#define  _CRT_SECURE_NO_WARNINGS 1
//乐乐的班级进行了一次期中考试，考试一共有3门科目：数学，语文，英语，
//小乐乐的班主任决定给没有通过考核的同学家长开一次家长会，考核的标准是三科平均分不低于60分，所以现在想请你帮忙算一算小乐乐会不会被叫家长。
//输入描述：
//一行，输入三个整数（表示小乐乐的数学、语文、英语的成绩），用空格分隔。
//输出描述：
//一行，如果小乐乐会被请家长则输出“YES”，否则输出“NO”
//#include<stdio.h>
//int main()
//{
//	int m, c, e;
//	int sum = 0;
//	scanf("%d %d %d",&m, &c, &e);
//	sum = (m + c + e) / 3;
//	if (sum < 60)
//	{
//		printf("YES");
//	}
//	else
//	{
//		printf("NO");
//	}
//	return 0;
//}
//小乐乐的班主任想统计一下班级里一共有多少人需要被请家长，三个成绩（语文，数学，外语）
//平均分低于60的将被请家长，小乐乐想编程帮助班主任算一下有多少同学被叫家长。
//输入描述：
//共n + 1行
//第一行，输入一个数n，代表小乐乐的班级中有n个同学。
//在接下来的n行中每行输入三个整数代表班级中一个同学的三科成绩（语文，数学，外语），用空格分隔。
//输出描述：
//一行，一个整数，代表班级中需要被请家长的人数。
//示例1
//#include<stdio.h>
//int main()
//{
//	int n;
//	int a, b, c;
//	scanf("%d", &n);
//	int i;
//	int sum = 0; int num = 0; 
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d %d %d", &a, &b, &c);
//		sum = a + b + c;
//		if ((sum / 3) < 60)
//		{
//
//			num++;
//		}
//	}
//	printf("%d", num);
//	return 0;
//}
//春天是鲜花的季节，水仙花就是其中最迷人的代表，数学上有个水仙花数，他是这样定义的： 
//“水仙花数”是指一个三位数，它的各位数字的立方和等于其本身，比如：153 = 1 ^ 3 + 5 ^ 3 + 3 ^ 3。 
//现在要求输出所有在m和n范围内的水仙花数。
//输入描述：
//输入数据有多组，每组占一行，包括两个整数m和n（100 ≤ m ≤ n ≤ 999）。
//输出描述：
//对于每个测试实例，要求输出所有在给定范围内的水仙花数，就是说，输出的水仙花数必须大于等于m, 
//并且小于等于n，如果有多个，则要求从小到大排列在一行内输出，之间用一个空格隔开; 如果给定的范围内不存在水仙花数
//，则输出no; 每个测试实例的输出占一行。
//示例1
//#include<stdio.h>
//int main()
//{
//	int m, n;
//	int g, s, b;
//	int sum=0;
//	while ((scanf("%d %d", &m, &n)) != EOF)
//	{
//		int i;
//		for (i = m; i <= n; i++)
//		{
//			g = i % 10;
//			s = (i / 10) % 10;
//			b = i / 100;
//			if (((g*g*g) + (s*s*s) + (b*b*b)) == i)
//			{
//				printf("%d ", i);
//				sum++;
//			}
//		}
//		if (sum == 0)
//		{
//			printf("no\n");
//		}
//	}
//	return 0;
//}
//转换六进制
//#include<stdio.h>
//void jzzh(int n)
//{
//	if (n >= 6)
//	{
//		jzzh(n/6);
//	}
//	int x = n % 6;
//	printf("%d", x);
//}
//int main()
//{
//	int n;
//	scanf("%d", &n);
//	jzzh(n);
//	return 0;
//}
//今天牛牛学到了回文串，他想在数字里面找回文，即回文数，
//回文数是正着读与倒着读都一样的数，比如1221，343是回文数，433不是回文数。请输出不超过n的回文数。
//输入描述：
//输入一个整数n(1 <= n <= 100000)
//输出描述：
//从1开始按从小到大的顺序输出所有回文数
//#include<stdio.h>
//int main()
//{
//	long int n, s, t;
//	scanf("%ld", &n);
//	int i;
//	for (i = 1; i <= n; i++)
//	{
//		t = 0;
//		s = i;
//		while (s!=0)
//		{
//			t = t * 10;
//			t = t + s % 10;
//			s = s / 10;
//		}
//		if (t == i) 
//		{
//			printf("%ld\n", i);
//		}
//	}
//	return 0;
//}
//小乐乐学会了自定义函数，BoBo老师给他出了个问题，根据以下公式计算m的值。
//其中 max3函数为计算三个数的最大值，如： max3(1, 2, 3) 返回结果为3。
//输入描述：
//一行，输入三个整数，用空格隔开，分别表示a, b, c。
//输出描述：
//一行，一个浮点数，小数点保留2位，为计算后m的值。
//#include<stdio.h>
//
//float max(float a, float b, float c)
//{
//	float num = a;
//	if (num < b)
//	{
//		num = b;
//	}
//	if (num < c)
//	{
//		num = c;
//	}
//	return num;
//}
//int main()
//{
//	float a, b, c;
//	float n;
//	scanf("%d %d %d", &a, &b, &c);
//	float x = max(a + b, b, c);
//	float y = max(a, b + c, c);
//	float z = max(a, b, b + c);
//	n = x / (y + z);
//	printf("%.2f", n);
//}
//求出[a, b]区间内有多少个数数位之和为5的倍数
//输入描述：
//输入一行包含两个整数a, b(1 <= a <= b <= 1000000)
//输出描述：
//输出一个整数
//#include<stdio.h>
//int main()
//{
//	int m, n;
//	scanf("%d %d", &m, &n);
//	int i;
//	int x = 0;
//	for (i = m; i <= n; i++)
//	{
//		int sum = 0;
//		int y = i;
//		while (y!=0)
//		{
//			sum+= y% 10;
//			y= y / 10;
//		}
//		if (sum % 5 == 0)
//		{
//			x++;
//		}
//	}
//	printf("%d", x);
//}
//：对于一个数，把他所有位上的数字进行加和，得到新的数。
//如果这个数字是个位数的话，那么他就满足条件。
//#include<stdio.h>
//void panduan(int n)
//{
//	while (n>=10)
//	{
//		int sum = 0;
//		while (n)
//		{
//			sum += n % 10;
//			n = n / 10;
//		}
//		n = sum;	
//		if (sum >= 0 && sum <= 9)
//		{
//			printf("%d",sum);
//		}
//	}
//}
//int main()
//{
//	int n;
//	scanf("%d", &n);
//	panduan(n);
//}